data/cfdb/verification/flat_plate_blasius_of/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Laminar flat-plate boundary layer (Blasius verification), 2D.
// U_inf = 1 m/s, nu = 1e-5 m^2/s -> Re_x = 1e5 * x[m]; stations x=0.1..1.0
// cover Re_x = 1e4..1e5, safely below transition (~5e5).
//
// Domain: inlet at x=-0.2 (development/slip fetch ahead of the leading
// edge so the uniform inlet does not sing against the wall), plate from
// x=0 to x=1.2, height 0.2 m (~12x the Blasius delta at x=1, delta~0.016).
//
// Grading: x-cells shrink toward the leading edge (block A ratio 0.1,
// block B ratio 10 -> first plate cell ~2 mm, matching the upstream block
// at the LE interface). y-cells shrink toward the wall (ratio 200, Ny=60
// -> first cell ~8.6e-5 m, ~20 cells inside the BL at x=0.1).

scale   1;

vertices
(
    (-0.2  0    0)      // 0
    ( 0    0    0)      // 1
    ( 1.2  0    0)      // 2
    (-0.2  0.2  0)      // 3
    ( 0    0.2  0)      // 4
    ( 1.2  0.2  0)      // 5
    (-0.2  0    0.01)   // 6
    ( 0    0    0.01)   // 7
    ( 1.2  0    0.01)   // 8
    (-0.2  0.2  0.01)   // 9
    ( 0    0.2  0.01)   // 10
    ( 1.2  0.2  0.01)   // 11
);

blocks
(
    // block A: slip fetch upstream of the leading edge
    hex (0 1 4 3 6 7 10 9) (25 60 1) simpleGrading (0.1 200 1)
    // block B: plate + continuation to the outlet
    hex (1 2 5 4 7 8 11 10) (150 60 1) simpleGrading (10 200 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 6 9 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 5 11 8)
        );
    }
    top
    {
        type symmetryPlane;
        faces
        (
            (3 9 10 4)
            (4 10 11 5)
        );
    }
    bottomUpstream
    {
        type symmetryPlane;
        faces
        (
            (0 1 7 6)
        );
    }
    plate
    {
        type wall;
        faces
        (
            (1 2 8 7)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 4 1)
            (1 4 5 2)
            (6 7 10 9)
            (7 8 11 10)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
