data/cfdb/verification/flat_plate_blasius_of/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// U_inf = 1 m/s; nu = 1e-5 m^2/s -> Re_x = 1e5 per metre of fetch.
transportModel  Newtonian;

nu              [0 2 -1 0 0 0 0] 1e-5;

// ************************************************************************* //
