data/cfdb/verification/flat_plate_blasius_of/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Steady SIMPLE iterations. endTime = iteration count (deltaT = 1).
application     simpleFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         2000;

deltaT          1;

writeControl    timeStep;
writeInterval   1000;

purgeWrite      0;

writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

functions
{
    // Wall shear stress on the plate -> postProcessing/wallShearStressPlate/.
    // Cf(x) = |wallShearStress.x| / (0.5 * rho * U_inf^2); incompressible
    // simpleFoam is per-unit-density, so 0.5*U_inf^2 = 0.5 here.
    wallShearStressPlate
    {
        type            wallShearStress;
        libs            ("libfieldFunctionObjects.so");
        patches         (plate);
        writeControl    writeTime;
    }
}

// ************************************************************************* //
